cases/C_vertical_stepped/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 101325.0;

boundaryField
{
    inlet
    {
        type                    calculated;
        value                   uniform 101325.0;
    }
    outlet
    {
        type                    calculated;
        value                   uniform 101325.0;
    }
    walls
    {
        type                    calculated;
        value                   uniform 101325.0;
    }
}
