cases/C_vertical_stepped/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.01;

boundaryField
{
    inlet
    {
        type                    inletOutlet;
        inletValue              uniform 0.01;
        value                   uniform 0.01;
    }
    outlet
    {
        type                    inletOutlet;
        inletValue              uniform 0.01;
        value                   uniform 0.01;
    }
    walls
    {
        type                    kqRWallFunction;
        value                   uniform 0.01;
    }
}
