cases/C_vertical_stepped/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    "rho.*" { solver diagonal; }
    p_rgh      { solver GAMG; tolerance 1e-7; relTol 0.01; smoother GaussSeidel; }
    p_rghFinal { $p_rgh; relTol 0; }
    "(U|h|e|k|epsilon)"      { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
    "(U|h|e|k|epsilon)Final" { $U; relTol 0; }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  3;
    nCorrectors       2;
    nNonOrthogonalCorrectors 1;
    pRefCell 0;
    pRefValue 101325;
}

relaxationFactors { equations { ".*" 1; } }
