cases/C_vertical_stepped/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

heatSource
{
    type            scalarSemiImplicitSource;
    selectionMode   cellZone;
    cellZone        fuelbed;
    volumeMode      absolute;

    injectionRateSuSp
    {
        h  (166666.7 0);
    }
}
